package com.join.menu;

public class JoinMenu {
	//출력할 메뉴를 따로 구성
	
	public String getMenu() {
		String s = ""
					+ "┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n"
					+ "┃      회원 가입 프로그램       ┃\n"
					+ "┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┫\n"
					+ "┃     1.        회원 가입       ┃\n"
					+ "┃     2.           로그인       ┃\n"
					+ "┃     3.    프로그램 종료       ┃\n"
					+ "┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n";
		return s;
	}
	public String getAfterLogin(String userid) {
		String s = ""
				+ "<<<<<<<" + userid + "님 환영합니다.\n"
				+"┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n"
				+"┃     1.        정보수정        ┃\n" 
				+"┃     2.        회원탈퇴        ┃\n"
				+"┃     3.        로그아웃        ┃\n"
				+"┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n";

		return s;
	}
	
	
}